deploy/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 30
      arrivalRate: 100
      name: "Stress test"
scenarios:
  - name: "Health check"
    weight: 10
    request:
      method: GET
      path: /health
  - name: "API auth flow"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "admin@test.com"
            password: "password"
          capture:
            - json: "$.token"
              as: "jwt_token"
      - get:
          url: "/api/v1/identities"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
  - name: "Identity listing"
    weight: 40
    request:
      method: GET
      path: "/api/v1/identities"
      headers:
        Authorization: "Bearer {{ $processEnv.JWT_TOKEN }}"
  - name: "Risk assessment"
    weight: 20
    request:
      method: GET
      path: "/api/v1/risk/summary"
      headers:
        Authorization: "Bearer {{ $processEnv.JWT_TOKEN }}"